app/controllers/emails_controller.rb

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "doyle_dare@klocko.org"], ["body", "The Killing Joke"], ["created_at", "2020-05-28 12:33:30.153659"], ["updated_at", "2020-05-28 12:33:30.153659"]]
---
    def create
      @email = Email.create!(object:  Faker::Internet.email,
      body: Faker::Lorem.sentence(word_count: 10))

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
    def show

      @email = Email.find(params[:id])